kylefoxaustin/mcxn947qemu/hw/arm/mcxn_soc.c
/*
 * NXP MCX N-series SoC (Arm Cortex-M33)
 *
 * Bring-up strategy: instantiate the ARMV7M container (CPU + NVIC + SysTick),
 * map code/SRAM, and cover the entire peripheral window with a single
 * "unimplemented" catch-all so that running real firmware logs exactly which
 * peripherals are touched (and in what order).  You then peel real device
 * models out of the catch-all one at a time.  This is deliberately
 * part-agnostic: only the MCXNConfig table below is SKU-specific.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/units.h"
#include "qapi/error.h"
#include "hw/arm/mcxn_soc.h"
#include "hw/core/qdev-clock.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-properties-system.h" /* qdev_prop_set_chr */
#include "hw/misc/unimp.h"
#include "hw/misc/mcxn_stub.h"
#include "hw/misc/mcxn_crc.h"
#include "hw/misc/mcxn_cdog.h"
#include "hw/misc/mcxn_ewm.h"
#include "hw/misc/mcxn_inputmux.h"
#include "hw/misc/mcxn_evtg.h"
#include "hw/misc/mcxn_plu.h"
#include "hw/misc/mcxn_freqme.h"
#include "hw/misc/mcxn_gdet.h"
#include "hw/misc/mcxn_itrc.h"
#include "hw/misc/mcxn_tdet.h"
#include "hw/misc/mcxn_cmc.h"
#include "hw/misc/mcxn_eim.h"
#include "hw/misc/mcxn_erm.h"
#include "hw/misc/mcxn_intm.h"
#include "hw/misc/mcxn_cmx_perfmon.h"
#include "hw/misc/mcxn_sema42.h"
#include "hw/misc/mcxn_mailbox.h"
#include "hw/misc/mcxn_vbat.h"
#include "hw/misc/mcxn_wuu.h"
#include "hw/misc/mcxn_otpc.h"
#include "hw/misc/mcxn_cache64_ctrl.h"
#include "hw/misc/mcxn_ahbsc.h"
#include "hw/misc/mcxn_bsp32.h"
#include "hw/misc/mcxn_dm.h"
#include "hw/misc/mcxn_pint.h"
#include "hw/misc/mcxn_utick.h"
#include "hw/misc/mcxn_wwdt.h"
#include "hw/misc/mcxn_opamp.h"
#include "hw/misc/mcxn_cmp.h"
#include "hw/misc/mcxn_vref.h"
#include "hw/misc/mcxn_els.h"
#include "hw/misc/mcxn_puf.h"
#include "hw/misc/mcxn_pkc.h"
#include "hw/misc/mcxn_trdc.h"
#include "hw/misc/mcxn_dac.h"
#include "hw/misc/mcxn_sinc.h"
#include "hw/misc/mcxn_pdm.h"
#include "hw/misc/mcxn_emvsim.h"
#include "hw/misc/mcxn_i3c.h"
#include "hw/misc/mcxn_flexio.h"
#include "hw/misc/mcxn_flexcan.h"
#include "hw/misc/mcxn_enet.h"
#include "hw/misc/mcxn_adc.h"
#include "hw/misc/mcxn_rtc.h"
#include "hw/misc/mcxn_tsi.h"
#include "hw/misc/mcxn_sai.h"
#include "hw/misc/mcxn_usdhc.h"
#include "hw/misc/mcxn_flexspi.h"
#include "hw/misc/mcxn_pwm.h"
#include "hw/misc/mcxn_qdc.h"
#include "hw/misc/mcxn_sct.h"
#include "hw/misc/mcxn_usbfs.h"
#include "hw/misc/mcxn_usbdcd.h"
#include "hw/misc/mcxn_usbphy.h"
#include "hw/misc/mcxn_usbhs.h"
#include "hw/misc/mcxn_smartdma.h"
#include "hw/misc/mcxn_powerquad.h"
#include "hw/misc/mcxn_npu.h"
#include "system/address-spaces.h"
#include "system/system.h"             /* serial_hd (older trees: sysemu/sysemu.h) */
#include "target/arm/cpu-qom.h" /* ARM_CPU_TYPE_NAME */

/* FRDM-MCXN947 debug console: FlexComm4 / LPUART4 (NS alias) + its NVIC line. */
#define MCXN_FLEXCOMM4_BASE  0x400B4000
#define MCXN_FLEXCOMM4_IRQ   39          /* CMSIS: LP_FLEXCOMM4_IRQn */
#define MCXN_SCG0_BASE       0x40044000  /* system clock generator (NS alias) */
#define MCXN_SYSCON_BASE     0x40000000  /* SYSCON (NS alias); CPU1 boot ctrl */
#define MCXN_SPC0_BASE       0x40045000  /* system power controller (NS alias) */

/* On-chip memory apertures (RM Table 16): each memory has a non-secure base
 * and a secure-alias base (TZ-M). */
#define MCXN_FLASH_NS   0x00000000        /* program flash, 2 MB             */
#define MCXN_FLASH_S    0x10000000
#define MCXN_ROM_NS     0x03000000        /* boot ROM, 256 KB               */
#define MCXN_ROM_S      0x13000000
#define MCXN_ROM_SIZE   (256 * KiB)
#define MCXN_SRAMX_NS   0x04000000        /* SRAMX (RAMX), 96 KB            */
#define MCXN_SRAMX_S    0x14000000
#define MCXN_SRAMX_SIZE (96 * KiB)
#define MCXN_SRAM_NS    0x20000000        /* main SRAM RAMA..H, 416 KB     */
#define MCXN_SRAM_S     0x30000000

/* TrustZone-M: secure peripheral alias = non-secure base + 0x1000_0000. */
#define MCXN_SECURE_ALIAS    0x10000000

/* ------------------------------------------------------------------------- *
 *  Per-SKU table.  Add new MCX variants here; nothing else needs to change.
 *
 *  MCXN947 values verified against the CMSIS device header
 *  (mcux-sdk: devices/MCXN947/MCXN947_cm33_core0.h):
 *    - highest IRQ = CTI0_IRQn (155)  -> num_irq = 156
 *    - __NVIC_PRIO_BITS = 3
 *    - M33 with FPU + DSP + MPU + SAU/TrustZone-M
 *  Memory bases verified against the NXP frdm_mcxn947 Zephyr linker: code
 *  flash is on the code bus at 0x1000_0000 (NOT the generic M-profile 0x0),
 *  the 512 KiB SRAM has a system-bus view at 0x2000_0000 and a code-bus alias
 *  at 0x3000_0000 (the view Zephyr links its RAM to), and SRAMX (96 KiB) sits
 *  at 0x1400_0000.  cpu reset reads its vector table from flash (init-svtor).
 * ------------------------------------------------------------------------- */
static const MCXNConfig mcxn_configs[] = {
    {
        .name          = "MCXN947",
        .cpu_type      = ARM_CPU_TYPE_NAME("cortex-m33"),
        .num_cpus      = 2,            /* dual Cortex-M33 (cpu0 + cpu1)        */
        .num_irq       = 156,          /* CMSIS: CTI0_IRQn=155, +1             */
        .num_prio_bits = 3,            /* CMSIS: __NVIC_PRIO_BITS              */
        .flash_base    = 0x10000000,   /* secure flash aperture (boot/svtor)  */
        .flash_size    = 2 * MiB,
        .sram_base     = 0x20000000,   /* main SRAM (RAMA..H) system-bus view */
        .sram_size     = 416 * KiB,    /* RAMA..H total (RM Table 16)         */
    },
    /* Add MCX N54x / N23x / A-series / W-series entries here. */
};

/* GPIO0..5 / PORT0..5 NS base addresses (CMSIS).  GPIO0..4 and PORT0..4 are on
 * a regular stride; GPIO5/PORT5 sit in a separate aliased block. */
static const hwaddr mcxn_gpio_base[MCXN_NUM_GPIO] = {
    0x40096000, 0x40098000, 0x4009A000, 0x4009C000, 0x4009E000, 0x40040000,
};
static const hwaddr mcxn_port_base[MCXN_NUM_PORT] = {
    0x40116000, 0x40117000, 0x40118000, 0x40119000, 0x4011A000, 0x40042000,
};

/* CTIMER0..4: NS base + NVIC IRQ (CMSIS). */
static const struct { hwaddr base; int irq; } mcxn_ctimer_cfg[MCXN_NUM_CTIMER] = {
    { 0x4000C000, 31 }, { 0x4000D000, 32 }, { 0x4000E000, 34 },
    { 0x4000F000, 55 }, { 0x40010000, 56 },
};

