kylefoxaustin/mcxn947qemu/hw/arm/mcxn_soc.c
#define MCXN_MRT0_BASE  0x40013000   /* Multi-Rate Timer */
#define MCXN_MRT0_IRQ   30

/* LPTMR0..1: NS base + NVIC IRQ (CMSIS). */
static const struct { hwaddr base; int irq; } mcxn_lptmr_cfg[MCXN_NUM_LPTMR] = {
    { 0x4004A000, 143 }, { 0x4004B000, 144 },
};

/* LP_FLEXCOMM0..9 in LPUART mode: base, NVIC IRQ, and host -serial index
 * (-1 = no backend).  FlexComm4 = cpu0 console, FlexComm2 = cpu1 console. */
static const struct { hwaddr base; int irq; int serial; }
mcxn_flexcomm_cfg[MCXN_NUM_FLEXCOMM] = {
    { 0x40092000, 35, -1 }, { 0x40093000, 36, -1 }, { 0x40094000, 37,  1 },
    { 0x40095000, 38, -1 }, { 0x400B4000, 39,  0 }, { 0x400B5000, 40, -1 },
    { 0x400B6000, 41, -1 }, { 0x400B7000, 42, -1 }, { 0x400B8000, 43, -1 },
    { 0x400B9000, 44, -1 },
};

/* Every other peripheral present on the SoC, covered by the generic permissive
 * stub until it gets a real model (see mcxn_peripherals.inc). */
typedef struct MCXNStubDesc {
    hwaddr      base;
    uint64_t    size;
    const char *name;
} MCXNStubDesc;

static const MCXNStubDesc mcxn_stub_table[] = {
#include "mcxn_peripherals.inc"
};

/* Functional register-accurate config blocks (MMIO only, no IRQ/clock). */
static const struct { const char *type; hwaddr base; } mcxn_cfgdev[] = {
    { TYPE_MCXN_CRC,      0x400CB000 },
    { TYPE_MCXN_CDOG,     0x400BB000 },   /* CDOG0 */
    { TYPE_MCXN_CDOG,     0x400BC000 },   /* CDOG1 */
    { TYPE_MCXN_EWM,      0x400C0000 },
    { TYPE_MCXN_INPUTMUX, 0x40006000 },
    { TYPE_MCXN_EVTG,     0x400D2000 },
    { TYPE_MCXN_PLU,      0x40034000 },
    { TYPE_MCXN_FREQME,   0x40011000 },
    { TYPE_MCXN_GDET,     0x40024000 },   /* GDET0 */
    { TYPE_MCXN_GDET,     0x40025000 },   /* GDET1 */
    { TYPE_MCXN_ITRC,     0x40026000 },
    { TYPE_MCXN_TDET,     0x40058000 },
    { TYPE_MCXN_CMC,      0x40048000 },
    { TYPE_MCXN_EIM,      0x4005B000 },
    { TYPE_MCXN_ERM,      0x4005C000 },
    { TYPE_MCXN_INTM,     0x4005D000 },
    { TYPE_MCXN_CMX_PERFMON, 0x400C1000 },   /* CMX_PERFMON0 */
    { TYPE_MCXN_CMX_PERFMON, 0x400C2000 },   /* CMX_PERFMON1 */
    { TYPE_MCXN_SEMA42,   0x400B1000 },
    /* MAILBOX 0x400B2000 instantiated explicitly below (cross-core IRQ wired). */
    { TYPE_MCXN_VBAT,     0x40059000 },
    { TYPE_MCXN_WUU,      0x40046000 },
    { TYPE_MCXN_OTPC,     0x400C9000 },
    /* One CACHE64 device covers the full window (POLSEL @0x14, CTRL @0x800). */
    { TYPE_MCXN_CACHE64_CTRL, 0x4001B000 },
    { TYPE_MCXN_AHBSC,    0x40120000 },
    { TYPE_MCXN_BSP32,    0x40032000 },
    { TYPE_MCXN_DM,       0x400BD000 },
    { TYPE_MCXN_PINT,     0x40004000 },
    { TYPE_MCXN_UTICK,    0x40012000 },
    { TYPE_MCXN_WWDT,     0x40016000 },   /* WWDT0 */
    { TYPE_MCXN_WWDT,     0x40017000 },   /* WWDT1 */
    { TYPE_MCXN_OPAMP,    0x40110000 },   /* OPAMP0 */
    { TYPE_MCXN_OPAMP,    0x40113000 },   /* OPAMP1 */
    { TYPE_MCXN_OPAMP,    0x40115000 },   /* OPAMP2 */
    { TYPE_MCXN_CMP,      0x40051000 },   /* CMP0 */
    { TYPE_MCXN_CMP,      0x40052000 },   /* CMP1 */
    { TYPE_MCXN_CMP,      0x40053000 },   /* CMP2 */
    { TYPE_MCXN_VREF,     0x40111000 },
    /* Security: ELS (EdgeLock), PUF, PKC (public-key crypto), TRDC. */
    { TYPE_MCXN_ELS,      0x40054000 },
    { TYPE_MCXN_PUF,      0x4002C000 },
    { TYPE_MCXN_PKC,      0x4002B000 },
    { TYPE_MCXN_TRDC,     0x400C7000 },
    /* Analog/audio: SINC, PDM.  (DAC0..2 + EMVSIM0/1 below — IRQs wired.) */
    { TYPE_MCXN_SINC,     0x40108000 },
    { TYPE_MCXN_PDM,      0x4010C000 },
    /* Comm/serial: FlexIO.  (I3C0/1 instantiated below — IRQs wired.) */
    { TYPE_MCXN_FLEXIO,   0x40105000 },
    /* Connectivity: FlexCAN0/1 and ENET instantiated below (IRQs wired). */
    /* Analog: TSI.  (ADC0/1 + RTC instantiated explicitly below — IRQ wired.) */
    { TYPE_MCXN_TSI,      0x40050000 },
    /* (SAI0/1 + uSDHC + FlexSPI instantiated below — IRQs wired.) */
    /* Motor/timer: QDC0/1.  (eFlexPWM0/1 + SCT below — IRQs wired.) */
    { TYPE_MCXN_QDC,      0x400CF000 },   /* QDC0 */
    { TYPE_MCXN_QDC,      0x400D1000 },   /* QDC1 */
    /* USB: FS-OTG, charger detect, HS PHY + HS core/non-core (OBMF-ICP path). */
    { TYPE_MCXN_USBFS,        0x400DD000 },
    { TYPE_MCXN_USBDCD,       0x400DC000 },
    { TYPE_MCXN_USBPHY,       0x4010A000 },   /* 0x800 window */
    { TYPE_MCXN_USBHS_PHYDCD, 0x4010A800 },   /* 0x800 window */
    { TYPE_MCXN_USBHS_CORE,   0x4010B000 },   /* 0x200 window */
    { TYPE_MCXN_USBHS_NC,     0x4010B200 },   /* 0xE00 window */
    /* Accelerators: SmartDMA, eIQ Neutron NPU (NPX).  (PowerQuad below — IRQ.) */
    { TYPE_MCXN_SMARTDMA,  0x40033000 },
    { TYPE_MCXN_NPU,       0x400CC000 },
};

static const MCXNConfig *mcxn_lookup(const char *part)
{
    int i;
    for (i = 0; i < ARRAY_SIZE(mcxn_configs); i++) {
        if (!strcmp(part, mcxn_configs[i].name)) {
            return &mcxn_configs[i];
        }
    }
    return NULL;
}

static void mcxn_soc_instance_init(Object *obj)
{
    MCXNState *s = MCXN_SOC(obj);
    int i;

    for (i = 0; i < MCXN_MAX_CPUS; i++) {
        g_autofree char *name = g_strdup_printf("cpu%d", i);
        object_initialize_child(obj, name, &s->armv7m[i], TYPE_ARMV7M);
    }
    for (i = 0; i < MCXN_NUM_FLEXCOMM; i++) {
        g_autofree char *name = g_strdup_printf("flexcomm%d", i);
        object_initialize_child(obj, name, &s->flexcomm[i], TYPE_MCXN_LPUART);
    }
    object_initialize_child(obj, "scg0", &s->scg0, TYPE_MCXN_SCG);
    object_initialize_child(obj, "syscon", &s->syscon, TYPE_MCXN_SYSCON);
    object_initialize_child(obj, "spc0", &s->spc0, TYPE_MCXN_SPC);
    for (i = 0; i < MCXN_NUM_GPIO; i++) {
        g_autofree char *name = g_strdup_printf("gpio%d", i);
        object_initialize_child(obj, name, &s->gpio[i], TYPE_MCXN_GPIO);
    }
    for (i = 0; i < MCXN_NUM_PORT; i++) {
        g_autofree char *name = g_strdup_printf("port%d", i);
        object_initialize_child(obj, name, &s->port[i], TYPE_MCXN_PORT);
    }
    for (i = 0; i < MCXN_NUM_CTIMER; i++) {
        g_autofree char *name = g_strdup_printf("ctimer%d", i);
        object_initialize_child(obj, name, &s->ctimer[i], TYPE_MCXN_CTIMER);
    }
    object_initialize_child(obj, "mrt0", &s->mrt0, TYPE_MCXN_MRT);
    for (i = 0; i < MCXN_NUM_LPTMR; i++) {
        g_autofree char *name = g_strdup_printf("lptmr%d", i);
        object_initialize_child(obj, name, &s->lptmr[i], TYPE_MCXN_LPTMR);
    }
    object_initialize_child(obj, "fmu0", &s->fmu0, TYPE_MCXN_FMU);
    object_initialize_child(obj, "ostimer0", &s->ostimer0, TYPE_MCXN_OSTIMER);
    for (i = 0; i < MCXN_NUM_EDMA; i++) {
        g_autofree char *name = g_strdup_printf("edma%d", i);
        object_initialize_child(obj, name, &s->edma[i], TYPE_MCXN_EDMA);
    }
    for (i = 0; i < MCXN_NUM_ADC; i++) {
        g_autofree char *name = g_strdup_printf("adc%d", i);
        object_initialize_child(obj, name, &s->adc[i], TYPE_MCXN_ADC);
    }
    for (i = 0; i < MCXN_NUM_EMVSIM; i++) {
        g_autofree char *name = g_strdup_printf("emvsim%d", i);
        object_initialize_child(obj, name, &s->emvsim[i], TYPE_MCXN_EMVSIM);
    }
    for (i = 0; i < MCXN_NUM_FLEXCAN; i++) {
        g_autofree char *name = g_strdup_printf("flexcan%d", i);
        object_initialize_child(obj, name, &s->flexcan[i], TYPE_MCXN_FLEXCAN);
    }
    object_initialize_child(obj, "enet0", &s->enet0, TYPE_MCXN_ENET);
    object_initialize_child(obj, "mailbox", &s->mailbox, TYPE_MCXN_MAILBOX);
    object_initialize_child(obj, "rtc0", &s->rtc0, TYPE_MCXN_RTC);
    object_initialize_child(obj, "usdhc0", &s->usdhc0, TYPE_MCXN_USDHC);
    object_initialize_child(obj, "flexspi0", &s->flexspi0, TYPE_MCXN_FLEXSPI);
    for (i = 0; i < MCXN_NUM_SAI; i++) {
        g_autofree char *name = g_strdup_printf("sai%d", i);
        object_initialize_child(obj, name, &s->sai[i], TYPE_MCXN_SAI);
    }
    for (i = 0; i < MCXN_NUM_DAC; i++) {
        g_autofree char *name = g_strdup_printf("dac%d", i);
        object_initialize_child(obj, name, &s->dac[i], TYPE_MCXN_DAC);
    }
    object_initialize_child(obj, "powerquad0", &s->powerquad0,
                            TYPE_MCXN_POWERQUAD);
    for (i = 0; i < MCXN_NUM_PWM; i++) {
        g_autofree char *name = g_strdup_printf("pwm%d", i);
        object_initialize_child(obj, name, &s->pwm[i], TYPE_MCXN_PWM);
    }
    object_initialize_child(obj, "sct0", &s->sct0, TYPE_MCXN_SCT);
    for (i = 0; i < MCXN_NUM_I3C; i++) {
        g_autofree char *name = g_strdup_printf("i3c%d", i);
        object_initialize_child(obj, name, &s->i3c[i], TYPE_MCXN_I3C);
    }

    /* Input clocks the board drives; forwarded to the ARMV7M container. */
    s->sysclk = qdev_init_clock_in(DEVICE(s), "sysclk", NULL, NULL, 0);
    s->refclk = qdev_init_clock_in(DEVICE(s), "refclk", NULL, NULL, 0);
}

