kylefoxaustin/mcxn947qemu/hw/arm/mcxn_soc.c
static void mcxn_soc_realize(DeviceState *dev, Error **errp)
{
    MCXNState     *s             = MCXN_SOC(dev);
    MemoryRegion  *system_memory = get_system_memory();
    const MCXNConfig *cfg;
    uint32_t ncpu;
    int i;

    cfg = mcxn_lookup(s->part ? s->part : "MCXN947");
    if (!cfg) {
        error_setg(errp, "mcxn-soc: unknown part '%s'", s->part);
        return;
    }
    s->cfg = cfg;

    /* --- On-chip memories (RM Table 16) ---------------------------------- *
     * Flash, boot ROM, SRAM and SRAMX, each reachable via a non-secure base
     * and a secure-alias base (TZ-M).  Flash and ROM are RAM-backed during
     * bring-up (the -kernel loader and, later, the FMU write them); swap flash
     * to ROM + FMU program/erase once that path is exercised.
     */
    memory_region_init_ram(&s->flash, OBJECT(dev), "mcxn.flash",
                           cfg->flash_size, &error_fatal);
    memory_region_add_subregion(system_memory, MCXN_FLASH_NS, &s->flash);
    memory_region_init_alias(&s->flash_alias, OBJECT(dev), "mcxn.flash.s",
                             &s->flash, 0, cfg->flash_size);
    memory_region_add_subregion(system_memory, MCXN_FLASH_S, &s->flash_alias);

    memory_region_init_ram(&s->rom, OBJECT(dev), "mcxn.rom-boot",
                           MCXN_ROM_SIZE, &error_fatal);
    memory_region_add_subregion(system_memory, MCXN_ROM_NS, &s->rom);
    memory_region_init_alias(&s->rom_alias, OBJECT(dev), "mcxn.rom-boot.s",
                             &s->rom, 0, MCXN_ROM_SIZE);
    memory_region_add_subregion(system_memory, MCXN_ROM_S, &s->rom_alias);

    memory_region_init_ram(&s->sramx, OBJECT(dev), "mcxn.sramx",
                           MCXN_SRAMX_SIZE, &error_fatal);
    memory_region_add_subregion(system_memory, MCXN_SRAMX_NS, &s->sramx);
    memory_region_init_alias(&s->sramx_alias, OBJECT(dev), "mcxn.sramx.s",
                             &s->sramx, 0, MCXN_SRAMX_SIZE);
    memory_region_add_subregion(system_memory, MCXN_SRAMX_S, &s->sramx_alias);

    memory_region_init_ram(&s->sram, OBJECT(dev), "mcxn.sram",
                           cfg->sram_size, &error_fatal);
    memory_region_add_subregion(system_memory, MCXN_SRAM_NS, &s->sram);
    memory_region_init_alias(&s->sram_alias, OBJECT(dev), "mcxn.sram.s",
                             &s->sram, 0, cfg->sram_size);
    memory_region_add_subregion(system_memory, MCXN_SRAM_S, &s->sram_alias);

    /* --- Cortex-M33 cores + NVIC + SysTick ------------------------------- *
     * The MCXN947 is a dual-M33 part.  Each ARMV7M wraps its "memory" link in
     * its own private per-core container (with that core's NVIC/SysTick/PPB),
     * so the two cores cannot share a single MemoryRegion directly — each gets
     * its OWN alias of the shared SoC map instead.  cpu0 is the primary boot
     * core; cpu1 starts held in reset (start-powered-off) and is released at
     * runtime by cpu0 firmware via the SYSCON CPUCTRL/CPBOOT block (see
     * mcxn_syscon).
     */
    ncpu = cfg->num_cpus ? cfg->num_cpus : 1;
    if (ncpu > MCXN_MAX_CPUS) {
        ncpu = MCXN_MAX_CPUS;
    }
    for (i = 0; i < ncpu; i++) {
        DeviceState *cpudev = DEVICE(&s->armv7m[i]);
        g_autofree char *view = g_strdup_printf("mcxn-cpu%d-view", i);

        memory_region_init_alias(&s->cpu_mem[i], OBJECT(dev), view,
                                 system_memory, 0, UINT64_MAX);

        qdev_prop_set_uint32(cpudev, "num-irq",       cfg->num_irq);
        qdev_prop_set_uint8 (cpudev, "num-prio-bits", cfg->num_prio_bits);
        qdev_prop_set_string(cpudev, "cpu-type",      cfg->cpu_type);
        qdev_prop_set_bit   (cpudev, "enable-bitband", false); /* M33: none */
        /* Reset reads the vector table (initial SP + reset PC) from flash. */
        qdev_prop_set_uint32(cpudev, "init-svtor",    cfg->flash_base);
        if (i > 0) {
            /* Secondary core(s) wait for an explicit SYSCON release. */
            qdev_prop_set_bit(cpudev, "start-powered-off", true);
        }
        qdev_connect_clock_in(cpudev, "cpuclk", s->sysclk);
        qdev_connect_clock_in(cpudev, "refclk", s->refclk);
        object_property_set_link(OBJECT(&s->armv7m[i]), "memory",
                                 OBJECT(&s->cpu_mem[i]), &error_abort);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->armv7m[i]), errp)) {
            return;
        }
    }

    /* --- Peripherals ----------------------------------------------------- *
     * Catch-all over BOTH peripheral aliases.  MCX N is TrustZone-M: every
     * peripheral is mapped twice — non-secure at 0x400x_xxxx and secure at
     * 0x500x_xxxx (CMSIS confirms bases up to ~0x4012_3000 / 0x5012_3000).
     * One region spanning 0x4000_0000..0x5FFF_FFFF covers both.  Run with
     *   -d unimp,guest_errors
     * to see every access, then replace slices with real models.
     *
     * Verified bases for the first real models (MCXN947 CMSIS, NS alias):
     *   - FlexComm4 / LPUART4  @ 0x400B_4000  -> FRDM debug console
     *       (same LPUART register block as i.MX 93/95 — reuse that model;
     *        the LP_FLEXCOMM wrapper just function-selects USART vs SPI/I2C)
     *   - SCG0 (clock gen)     @ 0x4004_4000
     *   - PORT0..5 / GPIO0..5  @ 0x4011_6000.. / 0x4009_6000..
     *   - CAN0 / CAN1 (FlexCAN)@ 0x400D_4000 / 0x400D_8000
     *   - eIQ Neutron NPU: IRQ 97; base from RM (not in CMSIS header).
     *       Model behaviourally (cf. the i.MX 95 Neutron / ZV3400 approach).
     */
    create_unimplemented_device("mcxn.periph", 0x40000000, 0x20000000);

    /* LP_FLEXCOMM0..9 as LPUARTs: each NS-mapped + secure alias, NVIC line
     * connected.  The console instances bind a host -serial chardev
     * (FlexComm4 = cpu0 console on serial_hd(0); FlexComm2 = cpu1 on
     * serial_hd(1)); the rest run without a host backend. */
    for (i = 0; i < MCXN_NUM_FLEXCOMM; i++) {
        DeviceState *fc = DEVICE(&s->flexcomm[i]);
        g_autofree char *aname = g_strdup_printf("mcxn.flexcomm%d.s", i);
        Chardev *chr = (mcxn_flexcomm_cfg[i].serial >= 0)
                       ? serial_hd(mcxn_flexcomm_cfg[i].serial) : NULL;

        if (chr) {
            qdev_prop_set_chr(fc, "chardev", chr);
        }
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->flexcomm[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->flexcomm[i]), 0,
                        mcxn_flexcomm_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->flexcomm[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            mcxn_flexcomm_cfg[i].irq));
        memory_region_init_alias(&s->flexcomm_s_alias[i], OBJECT(dev), aname,
                                 &s->flexcomm[i].iomem, 0, 0x1000);
        memory_region_add_subregion(system_memory,
                                     mcxn_flexcomm_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->flexcomm_s_alias[i]);
    }

    /* SCG0 clock generator (stub: reports oscillators/PLLs ready). */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->scg0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->scg0), 0, MCXN_SCG0_BASE);
    memory_region_init_alias(&s->scg0_s_alias, OBJECT(dev),
                             "mcxn.scg0.s", &s->scg0.iomem, 0, MCXN_SCG_SIZE);
    memory_region_add_subregion(system_memory,
                                MCXN_SCG0_BASE + MCXN_SECURE_ALIAS,
                                &s->scg0_s_alias);

    /* SYSCON: models the CPUCTRL/CPBOOT handover cpu0 uses to release cpu1.
     * Linked to the secondary core so a CPUCTRL write can start it. */
    if (ncpu > 1) {
        object_property_set_link(OBJECT(&s->syscon), "cpu1",
                                 OBJECT(s->armv7m[1].cpu), &error_abort);
    }
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->syscon), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->syscon), 0, MCXN_SYSCON_BASE);
    memory_region_init_alias(&s->syscon_s_alias, OBJECT(dev),
                             "mcxn.syscon.s", &s->syscon.iomem, 0,
                             MCXN_SYSCON_SIZE);
    memory_region_add_subregion(system_memory,
                                MCXN_SYSCON_BASE + MCXN_SECURE_ALIAS,
                                &s->syscon_s_alias);

    /* Inter-CPU MAILBOX: cross-core notification.  IRQ[0]->cpu0, IRQ[1]->cpu1,
     * both on MAILBOX_IRQn = 54.  This is the rpmsg/OpenAMP signalling path. */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->mailbox), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->mailbox), 0, 0x400B2000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->mailbox), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 54));
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->mailbox), 1,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[ncpu > 1 ? 1 : 0]), 54));
    memory_region_init_alias(&s->mailbox_s_alias, OBJECT(dev), "mcxn.mailbox.s",
                             &s->mailbox.iomem, 0, MCXN_MAILBOX_SIZE);
    memory_region_add_subregion(system_memory, 0x400B2000 + MCXN_SECURE_ALIAS,
                                &s->mailbox_s_alias);

    /* SPC system power controller (SRAMCTL REQ/ACK handshake for boot). */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->spc0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->spc0), 0, MCXN_SPC0_BASE);
    memory_region_init_alias(&s->spc0_s_alias, OBJECT(dev), "mcxn.spc0.s",
                             &s->spc0.iomem, 0, MCXN_SPC_SIZE);
    memory_region_add_subregion(system_memory, MCXN_SPC0_BASE + MCXN_SECURE_ALIAS,
                                &s->spc0_s_alias);

    /* GPIO0..5 controllers and PORT0..5 pin-mux, each NS + secure alias. */
    for (i = 0; i < MCXN_NUM_GPIO; i++) {
        g_autofree char *aname = g_strdup_printf("mcxn.gpio%d.s", i);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->gpio[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->gpio[i]), 0, mcxn_gpio_base[i]);
        memory_region_init_alias(&s->gpio_s_alias[i], OBJECT(dev), aname,
                                 &s->gpio[i].iomem, 0, MCXN_GPIO_SIZE);
        memory_region_add_subregion(system_memory,
                                     mcxn_gpio_base[i] + MCXN_SECURE_ALIAS,
                                     &s->gpio_s_alias[i]);
    }
    for (i = 0; i < MCXN_NUM_PORT; i++) {
        g_autofree char *aname = g_strdup_printf("mcxn.port%d.s", i);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->port[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->port[i]), 0, mcxn_port_base[i]);
        memory_region_init_alias(&s->port_s_alias[i], OBJECT(dev), aname,
                                 &s->port[i].iomem, 0, MCXN_PORT_SIZE);
        memory_region_add_subregion(system_memory,
                                     mcxn_port_base[i] + MCXN_SECURE_ALIAS,
                                     &s->port_s_alias[i]);
    }

    /* CTIMER0..4: functional counter/timers, IRQ to cpu0 NVIC, clocked by the
     * SoC main clock (real divider lives in the stubbed clock tree). */
    for (i = 0; i < MCXN_NUM_CTIMER; i++) {
        DeviceState *t = DEVICE(&s->ctimer[i]);
        g_autofree char *aname = g_strdup_printf("mcxn.ctimer%d.s", i);

