kylefoxaustin/mcxn947qemu/hw/arm/mcxn_soc.c
        qdev_connect_clock_in(t, "clk", s->sysclk);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->ctimer[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->ctimer[i]), 0, mcxn_ctimer_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->ctimer[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            mcxn_ctimer_cfg[i].irq));
        memory_region_init_alias(&s->ctimer_s_alias[i], OBJECT(dev), aname,
                                 &s->ctimer[i].iomem, 0, 0x1000);
        memory_region_add_subregion(system_memory,
                                     mcxn_ctimer_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->ctimer_s_alias[i]);
    }

    /* MRT (Multi-Rate Timer): functional, IRQ to cpu0 NVIC. */
    qdev_connect_clock_in(DEVICE(&s->mrt0), "clk", s->sysclk);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->mrt0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->mrt0), 0, MCXN_MRT0_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->mrt0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), MCXN_MRT0_IRQ));
    memory_region_init_alias(&s->mrt0_s_alias, OBJECT(dev), "mcxn.mrt0.s",
                             &s->mrt0.iomem, 0, 0x1000);
    memory_region_add_subregion(system_memory, MCXN_MRT0_BASE + MCXN_SECURE_ALIAS,
                                &s->mrt0_s_alias);

    /* LPTMR0..1: functional, IRQ to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_LPTMR; i++) {
        DeviceState *t = DEVICE(&s->lptmr[i]);
        g_autofree char *aname = g_strdup_printf("mcxn.lptmr%d.s", i);

        qdev_connect_clock_in(t, "clk", s->sysclk);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->lptmr[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->lptmr[i]), 0, mcxn_lptmr_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->lptmr[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            mcxn_lptmr_cfg[i].irq));
        memory_region_init_alias(&s->lptmr_s_alias[i], OBJECT(dev), aname,
                                 &s->lptmr[i].iomem, 0, 0x1000);
        memory_region_add_subregion(system_memory,
                                     mcxn_lptmr_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->lptmr_s_alias[i]);
    }

    /* eDMA DMA0..1: 16 channels each, channel IRQs to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_EDMA; i++) {
        static const struct { hwaddr base; int irq0; }
        edma_cfg[MCXN_NUM_EDMA] = { { 0x40080000, 1 }, { 0x400A0000, 77 } };
        g_autofree char *aname = g_strdup_printf("mcxn.edma%d.s", i);
        uint64_t sz = 0x1000 * (MCXN_EDMA_CHANNELS + 1);
        int ch;

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->edma[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->edma[i]), 0, edma_cfg[i].base);
        for (ch = 0; ch < MCXN_EDMA_CHANNELS; ch++) {
            sysbus_connect_irq(SYS_BUS_DEVICE(&s->edma[i]), ch,
                               qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                                edma_cfg[i].irq0 + ch));
        }
        memory_region_init_alias(&s->edma_s_alias[i], OBJECT(dev), aname,
                                 &s->edma[i].iomem, 0, sz);
        memory_region_add_subregion(system_memory,
                                     edma_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->edma_s_alias[i]);
    }

    /* ADC0..1 (LPADC): conversion-complete IRQ to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_ADC; i++) {
        static const struct { hwaddr base; int irq; }
        adc_cfg[MCXN_NUM_ADC] = { { 0x4010D000, 45 }, { 0x4010E000, 46 } };
        g_autofree char *aname = g_strdup_printf("mcxn.adc%d.s", i);

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->adc[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->adc[i]), 0, adc_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->adc[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            adc_cfg[i].irq));
        memory_region_init_alias(&s->adc_s_alias[i], OBJECT(dev), aname,
                                 &s->adc[i].iomem, 0, MCXN_ADC_SIZE);
        memory_region_add_subregion(system_memory,
                                     adc_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->adc_s_alias[i]);
    }

    /* EMVSIM0..1 (smartcard): transmit-complete IRQ to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_EMVSIM; i++) {
        static const struct { hwaddr base; int irq; }
        emvsim_cfg[MCXN_NUM_EMVSIM] = { { 0x40103000, 103 }, { 0x40104000, 104 } };
        g_autofree char *aname = g_strdup_printf("mcxn.emvsim%d.s", i);

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->emvsim[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->emvsim[i]), 0, emvsim_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->emvsim[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            emvsim_cfg[i].irq));
        memory_region_init_alias(&s->emvsim_s_alias[i], OBJECT(dev), aname,
                                 &s->emvsim[i].iomem, 0, MCXN_EMVSIM_SIZE);
        memory_region_add_subregion(system_memory,
                                     emvsim_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->emvsim_s_alias[i]);
    }

    /* FlexCAN CAN0..1: message-buffer interrupt to cpu0 NVIC.  0x4000 window. */
    for (i = 0; i < MCXN_NUM_FLEXCAN; i++) {
        static const struct { hwaddr base; int irq; }
        can_cfg[MCXN_NUM_FLEXCAN] = { { 0x400D4000, 62 }, { 0x400D8000, 63 } };
        g_autofree char *aname = g_strdup_printf("mcxn.flexcan%d.s", i);

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->flexcan[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->flexcan[i]), 0, can_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->flexcan[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            can_cfg[i].irq));
        memory_region_init_alias(&s->flexcan_s_alias[i], OBJECT(dev), aname,
                                 &s->flexcan[i].iomem, 0, MCXN_FLEXCAN_SIZE);
        memory_region_add_subregion(system_memory,
                                     can_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->flexcan_s_alias[i]);
    }

    /* ENET (Ethernet QoS): MAC/PHY-event interrupt to cpu0 NVIC.  0x2000 win.
     * Connect a host network backend (-nic) so real frames can flow; MAC
     * loopback mode still works without one. */
    qemu_configure_nic_device(DEVICE(&s->enet0), true, NULL);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->enet0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->enet0), 0, 0x40100000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->enet0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 139));
    memory_region_init_alias(&s->enet0_s_alias, OBJECT(dev), "mcxn.enet0.s",
                             &s->enet0.iomem, 0, MCXN_ENET_SIZE);
    memory_region_add_subregion(system_memory, 0x40100000 + MCXN_SECURE_ALIAS,
                                &s->enet0_s_alias);

    /* RTC (calendar): 1 Hz tick + alarm interrupt to cpu0 NVIC. */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->rtc0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->rtc0), 0, 0x4004C000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->rtc0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 52));
    memory_region_init_alias(&s->rtc0_s_alias, OBJECT(dev), "mcxn.rtc0.s",
                             &s->rtc0.iomem, 0, MCXN_RTC_SIZE);
    memory_region_add_subregion(system_memory, 0x4004C000 + MCXN_SECURE_ALIAS,
                                &s->rtc0_s_alias);

    /* uSDHC (SD/MMC host): command/transfer-complete interrupt to cpu0 NVIC. */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->usdhc0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->usdhc0), 0, 0x40109000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->usdhc0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 61));
    memory_region_init_alias(&s->usdhc0_s_alias, OBJECT(dev), "mcxn.usdhc0.s",
                             &s->usdhc0.iomem, 0, MCXN_USDHC_SIZE);
    memory_region_add_subregion(system_memory, 0x40109000 + MCXN_SECURE_ALIAS,
                                &s->usdhc0_s_alias);

    /* FlexSPI (external flash controller): IP-command-done IRQ to cpu0 NVIC. */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->flexspi0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->flexspi0), 0, 0x400C8000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->flexspi0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 58));
    memory_region_init_alias(&s->flexspi0_s_alias, OBJECT(dev), "mcxn.flexspi0.s",
                             &s->flexspi0.iomem, 0, MCXN_FLEXSPI_SIZE);
    memory_region_add_subregion(system_memory, 0x400C8000 + MCXN_SECURE_ALIAS,
                                &s->flexspi0_s_alias);

    /* SAI0..1 (audio): FIFO-request/error interrupt to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_SAI; i++) {
        static const struct { hwaddr base; int irq; }
        sai_cfg[MCXN_NUM_SAI] = { { 0x40106000, 59 }, { 0x40107000, 60 } };
        g_autofree char *aname = g_strdup_printf("mcxn.sai%d.s", i);

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->sai[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->sai[i]), 0, sai_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->sai[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            sai_cfg[i].irq));
        memory_region_init_alias(&s->sai_s_alias[i], OBJECT(dev), aname,
                                 &s->sai[i].iomem, 0, MCXN_SAI_SIZE);
        memory_region_add_subregion(system_memory,
                                     sai_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->sai_s_alias[i]);
    }

    /* DAC0..2: FIFO watermark/empty/error interrupt to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_DAC; i++) {
        static const struct { hwaddr base; int irq; }
        dac_cfg[MCXN_NUM_DAC] = { { 0x4010F000, 106 }, { 0x40112000, 107 },
                                  { 0x40114000, 108 } };
        g_autofree char *aname = g_strdup_printf("mcxn.dac%d.s", i);

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->dac[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->dac[i]), 0, dac_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->dac[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            dac_cfg[i].irq));
        memory_region_init_alias(&s->dac_s_alias[i], OBJECT(dev), aname,
                                 &s->dac[i].iomem, 0, MCXN_DAC_SIZE);
        memory_region_add_subregion(system_memory,
                                     dac_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->dac_s_alias[i]);
    }

    /* PowerQuad (DSP coprocessor): compute-complete interrupt to cpu0 NVIC. */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->powerquad0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->powerquad0), 0, 0x400BF000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->powerquad0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 76));
    memory_region_init_alias(&s->powerquad0_s_alias, OBJECT(dev),
                             "mcxn.powerquad0.s", &s->powerquad0.iomem, 0,
                             MCXN_POWERQUAD_SIZE);
    memory_region_add_subregion(system_memory, 0x400BF000 + MCXN_SECURE_ALIAS,
                                &s->powerquad0_s_alias);

