kylefoxaustin/mcxn947qemu/hw/arm/mcxn_soc.c
    /* eFlexPWM0..1: submodule-0 reload/compare interrupt to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_PWM; i++) {
        static const struct { hwaddr base; int irq; }
        pwm_cfg[MCXN_NUM_PWM] = { { 0x400CE000, 114 }, { 0x400D0000, 120 } };
        g_autofree char *aname = g_strdup_printf("mcxn.pwm%d.s", i);

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->pwm[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->pwm[i]), 0, pwm_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->pwm[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            pwm_cfg[i].irq));
        memory_region_init_alias(&s->pwm_s_alias[i], OBJECT(dev), aname,
                                 &s->pwm[i].iomem, 0, MCXN_PWM_SIZE);
        memory_region_add_subregion(system_memory,
                                     pwm_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->pwm_s_alias[i]);
    }

    /* SCT (SCTimer/PWM): match/limit event interrupt to cpu0 NVIC. */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->sct0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->sct0), 0, 0x40091000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->sct0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 33));
    memory_region_init_alias(&s->sct0_s_alias, OBJECT(dev), "mcxn.sct0.s",
                             &s->sct0.iomem, 0, MCXN_SCT_SIZE);
    memory_region_add_subregion(system_memory, 0x40091000 + MCXN_SECURE_ALIAS,
                                &s->sct0_s_alias);

    /* I3C0..1: controller transfer-complete interrupt to cpu0 NVIC. */
    for (i = 0; i < MCXN_NUM_I3C; i++) {
        static const struct { hwaddr base; int irq; }
        i3c_cfg[MCXN_NUM_I3C] = { { 0x40021000, 95 }, { 0x40022000, 96 } };
        g_autofree char *aname = g_strdup_printf("mcxn.i3c%d.s", i);

        if (!sysbus_realize(SYS_BUS_DEVICE(&s->i3c[i]), errp)) {
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(&s->i3c[i]), 0, i3c_cfg[i].base);
        sysbus_connect_irq(SYS_BUS_DEVICE(&s->i3c[i]), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m[0]),
                                            i3c_cfg[i].irq));
        memory_region_init_alias(&s->i3c_s_alias[i], OBJECT(dev), aname,
                                 &s->i3c[i].iomem, 0, MCXN_I3C_SIZE);
        memory_region_add_subregion(system_memory,
                                     i3c_cfg[i].base + MCXN_SECURE_ALIAS,
                                     &s->i3c_s_alias[i]);
    }

    /* OSTIMER (OS event timer): 1 MHz default clock, match IRQ to cpu0 NVIC. */
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->ostimer0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->ostimer0), 0, 0x40049000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->ostimer0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 57));
    memory_region_init_alias(&s->ostimer0_s_alias, OBJECT(dev), "mcxn.ostimer0.s",
                             &s->ostimer0.iomem, 0, 0x1000);
    memory_region_add_subregion(system_memory, 0x40049000 + MCXN_SECURE_ALIAS,
                                &s->ostimer0_s_alias);

    /* FMU flash controller: knows the flash backing so erase/verify work;
     * IRQ to cpu0 NVIC. */
    s->fmu0.flash = &s->flash;
    s->fmu0.flash_size = cfg->flash_size;
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->fmu0), errp)) {
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(&s->fmu0), 0, 0x40043000);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->fmu0), 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m[0]), 138));
    memory_region_init_alias(&s->fmu0_s_alias, OBJECT(dev), "mcxn.fmu0.s",
                             &s->fmu0.iomem, 0, 0x1000);
    memory_region_add_subregion(system_memory, 0x40043000 + MCXN_SECURE_ALIAS,
                                &s->fmu0_s_alias);

    /* Functional register-accurate config blocks (MMIO only): each NS + secure
     * alias.  Instantiated dynamically since they need no IRQ/clock wiring. */
    for (i = 0; i < (int)ARRAY_SIZE(mcxn_cfgdev); i++) {
        DeviceState *d = qdev_new(mcxn_cfgdev[i].type);
        MemoryRegion *al = g_new(MemoryRegion, 1);
        g_autofree char *cn = g_strdup_printf("cfgdev%d", i);
        g_autofree char *an = g_strdup_printf("mcxn.cfg%d.s", i);
        MemoryRegion *mr;

        object_property_add_child(OBJECT(dev), cn, OBJECT(d));
        sysbus_realize_and_unref(SYS_BUS_DEVICE(d), &error_abort);
        sysbus_mmio_map(SYS_BUS_DEVICE(d), 0, mcxn_cfgdev[i].base);
        mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(d), 0);
        memory_region_init_alias(al, OBJECT(dev), an, mr, 0,
                                 memory_region_size(mr));
        memory_region_add_subregion(system_memory,
                                     mcxn_cfgdev[i].base + MCXN_SECURE_ALIAS, al);
    }

    /* Generic permissive stubs for every other peripheral present on the SoC
     * (present + register read-back + non-blocking), each NS + secure alias.
     * Replace entries with real device models over time. */
    for (i = 0; i < (int)ARRAY_SIZE(mcxn_stub_table); i++) {
        const MCXNStubDesc *d = &mcxn_stub_table[i];
        DeviceState *stub = qdev_new(TYPE_MCXN_STUB);
        MemoryRegion *salias = g_new(MemoryRegion, 1);
        g_autofree char *sname = g_strdup_printf("mcxn.%s.s", d->name);

        object_property_add_child(OBJECT(dev), d->name, OBJECT(stub));
        qdev_prop_set_string(stub, "blkname", d->name);
        qdev_prop_set_uint64(stub, "size", d->size);
        sysbus_realize_and_unref(SYS_BUS_DEVICE(stub), &error_abort);
        sysbus_mmio_map(SYS_BUS_DEVICE(stub), 0, d->base);
        memory_region_init_alias(salias, OBJECT(dev), sname,
                                 sysbus_mmio_get_region(SYS_BUS_DEVICE(stub), 0),
                                 0, d->size);
        memory_region_add_subregion(system_memory,
                                     d->base + MCXN_SECURE_ALIAS, salias);
    }
}

static const Property mcxn_soc_properties[] = {
    DEFINE_PROP_STRING("part", MCXNState, part),
};

static void mcxn_soc_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_soc_realize;
    device_class_set_props(dc, mcxn_soc_properties);
    /* SoC container: not directly user-creatable. */
    dc->user_creatable = false;
}

static const TypeInfo mcxn_soc_types[] = {
    {
        .name          = TYPE_MCXN_SOC,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNState),
        .instance_init = mcxn_soc_instance_init,
        .class_init    = mcxn_soc_class_init,
    },
};

DEFINE_TYPES(mcxn_soc_types)
